<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Custom Message Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'internal_server_error' => 'সার্ভারে একটি ত্রুটি ঘটেছে। অনুগ্রহ করে পরে আবার চেষ্টা করুন',
    'otp_sent' => 'ভেরিফিকেশন কোড পাঠানো হয়েছে',
    'otp_resent' => 'ভেরিফিকেশন কোড পুনরায় পাঠানো হয়েছে',
    'otp_sending_blocked' => 'আপনার এই নম্বরটি ৫ মিনিটের জন্য ব্লক করা হয়েছে। অনুগ্রহ করে অপেক্ষা করুন',
    'user_inactive' => 'আপনার অ্যাকাউন্ট নিষ্ক্রিয় করা হয়েছে। অনুগ্রহ করে অ্যাডমিনিস্ট্রেটরের সাথে যোগাযোগ করুন',
    'user_deleted' => 'আপনার তথ্য মুছে ফেলা হয়েছে',


    /*
    |--------------------------------------------------------------------------
    | Custom Message Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom messages.
    |
    */

    'custom' => [
        'configuration' => [
            'update' => [
                'basicInfo' => [
                    'success' => 'প্রতিষ্ঠানের মৌলিক তথ্য সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'প্রতিষ্ঠানের মৌলিক তথ্য আপডেট করা যায় নি'
                ],
                'additionalInfo' => [
                    'success' => 'প্রতিষ্ঠানের অতিরিক্ত তথ্য সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'প্রতিষ্ঠানের অতিরিক্ত তথ্য আপডেট করা যায় নি'
                ],
                'contactInfo' => [
                    'success' => 'প্রতিষ্ঠানের যোগাযোগের তথ্য সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'প্রতিষ্ঠানের যোগাযোগের তথ্য আপডেট করা যায় নি'
                ]
            ]
        ],

        'user' => [
            'store' => [
                'success' => 'নতুন ইউজার সফলভাবে তৈরি করা হয়েছে',
                'error' => 'নতুন ইউজার তৈরি করা যায় নি'
            ],
            'update' => [
                'basic' => [
                    'success' => 'ইউজারের তথ্য সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'ইউজারের তথ্য আপডেট করা যায় নি'
                ],
                'profile' => [
                    'success' => 'ইউজারের প্রোফাইল আপডেট করা হয়েছে',
                    'error' => 'ইউজারের প্রোফাইল আপডেট করা যায় নি'
                ],
                'updateDetails' => [
                    'success' => 'ইউজারের তথ্য সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'ইউজারের তথ্য আপডেট করা যায় নি'
                ],
                'updateEmail' => [
                    'success' => 'ইউজারের ইমেইল সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'ইউজারের ইমেইল আপডেট করা যায় নি'
                ],
                'updateRoles' => [
                    'success' => 'ইউজারের রোল সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'ইউজারের রোল আপডেট করা যায় নি'
                ],
                'updatePassword' => [
                    'success' => 'পাসওয়ার্ড সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'পাসওয়ার্ড আপডেট করা যায় নি'
                ]
            ],
            'destroy' => [
                'success' => 'ইউজারকে সফলভাবে মুছে ফেলা হয়েছে',
                'error' => 'ইউজারকে মুছে ফেলা যায় নি'
            ],
            'changeStatus' => [
                'activate' => 'ইউজারকে সক্রিয় করা হয়েছে',
                'deactivate' => 'ইউজারকে নিষ্ক্রিয় করা হয়েছে',
                'error' => 'ইউজারের স্ট্যাটাস পরিবর্তন করা যায় নি'
            ]
        ],

        'role' => [
            'store' => [
                'success' => 'নতুন রোল সফলভাবে তৈরি করা হয়েছে',
                'error' => 'নতুন রোল তৈরি করা যায় নি'
            ],
            'update' => [
                'success' => 'রোল এবং পারমিশন সফলভাবে আপডেট করা হয়েছে',
                'error' => 'রোল এবং পারমিশন আপডেট করা যায় নি'
            ],
            'destroy' => [
                'basic' => [
                    'success' => 'রোল এবং পারমিশন সফলভাবে মুছে ফেলা হয়েছে',
                    'error' => 'রোল এবং পারমিশন মুছে ফেলা যায় নি',
                ],
                'removeUserFromRole' => [
                    'success' => 'রোল থেকে ইউজারকে সফলভাবে সরানো হয়েছে',
                    'error' => 'রোল থেকে ইউজারকে মুছে ফেলা যায় নি'
                ]
            ],
            'changeStatus' => [
                'activate' => 'রোলটি সক্রিয় করা হয়েছে',
                'deactivate' => 'রোলটি নিষ্ক্রিয় করা হয়েছে',
                'error' => 'সুপার এডমিন এর স্ট্যাটাস পরিবর্তন করা যাবে না'
            ]
        ],

        'branch' => [
            'store' => [
                'success' => 'নতুন ব্রাঞ্চ সফলভাবে তৈরি করা হয়েছে',
                'error' => 'নতুন ব্রাঞ্চ তৈরি করা যায়নি'
            ],
            'update' => [
                'success' => 'ব্রাঞ্চটি সফলভাবে আপডেট করা হয়েছে',
                'error' => 'ব্রাঞ্চটি আপডেট করা যায় নি'
            ],
            'destroy' => [
                'success' => 'ব্রাঞ্চটি সফলভাবে মুছে ফেলা হয়েছে',
                'error' => 'ব্রাঞ্চটি মুছে ফেলা যায় নি'
            ],
            'employeeOptions' => 'ব্রাঞ্চের নাম দিয়ে কর্মচারী বাছাই',
            'changeStatus' => [
                'activate' => 'ব্রাঞ্চটি সক্রিয় করা হয়েছে',
                'deactivate' => 'ব্রাঞ্চটি নিষ্ক্রিয় করা হয়েছে'
            ]
        ],

        'employee' => [
            'attendanceLog' => [
                'store' => [
                    'success' => 'কর্মচারীর উপস্থিতি লগ সফলভাবে তৈরি করা হয়েছে',
                    'error' => 'কর্মচারীর উপস্থিতি লগ তৈরি করা যায়নি'
                ],
                'checkout' => [
                    'success' => 'কর্মচারীকে সফলভাবে চেক আউট করা হয়েছে',
                    'error' => 'কর্মচারীকে চেক আউট করা যায়নি'
                ]
            ],
            'attendanceRequest' => [
                'store' => [
                    'success' => 'অনুপস্থিত উপস্থিতি দিতে সফলভাবে ম্যানেজারকে অনুরোধ করা হয়েছে',
                    'error' => 'অনুপস্থিত উপস্থিতি দিতে ম্যানেজারকে অনুরোধ করা যায়নি'
                ]
            ]
        ],

        'employeeManagement' => [
            'attendanceLog' => [
                'store' => [
                    'success' => 'উপস্থিতি লগ সফলভাবে তৈরি করা হয়েছে',
                    'error' => 'উপস্থিতি লগ তৈরি করা যায়নি'
                ],
                'update' => [
                    'success' => 'উপস্থিতি লগ সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'উপস্থিতি লগ আপডেট করা যায়নি'
                ],
                'destroy' => [
                    'success' => 'উপস্থিতি লগ সফলভাবে মুছে ফেলা হয়েছে',
                    'error' => 'উপস্থিতি লগ মুছে ফেলা যায় নি'
                ]
            ],
            'attendanceRequest' => [
                'approveAttendanceRequest' => [
                    'success' => 'উপস্থিতির অনুরোধ সফলভাবে অনুমোদন দেওয়া হয়েছে',
                    'error' => 'উপস্থিতির অনুরোধ অনুমোদন দেওয়া যায় নি'
                ],
                'declineAttendanceRequest' => [
                    'success' => 'উপস্থিতির অনুরোধ সফলভাবে প্রত্যাখ্যান করা হয়েছে',
                    'error' => 'উপস্থিতির অনুরোধ প্রত্যাখ্যান করা যায় নি'
                ]
            ],
            'employee' => [
                'store' => [
                    'success' => 'নতুন কর্মচারী সফলভাবে তৈরি করা হয়েছে',
                    'error' => 'নতুন কর্মচারী তৈরি করা যায় নি'
                ],
                'destroy' => [
                    'success' => 'কর্মচারীকে সফলভাবে মুছে ফেলা হয়েছে',
                    'error' => 'কর্মচারীকে মুছে ফেলা যায় নি'
                ],
                'update' => [
                    'basicInfo' => [
                        'success' => 'কর্মচারীর মৌলিক তথ্য সফলভাবে আপডেট করা হয়েছে',
                        'error' => 'কর্মচারীর মৌলিক তথ্য আপডেট করা যায় নি'
                    ],
                    'additionalInfo' => [
                        'success' => 'কর্মচারীর অতিরিক্ত তথ্য সফলভাবে আপডেট করা হয়েছে',
                        'error' => 'কর্মচারীর অতিরিক্ত তথ্য আপডেট করা যায় নি'
                    ],
                    'workInfo' => [
                        'success' => 'কর্মচারীর কাজের তথ্য সফলভাবে আপডেট করা হয়েছে',
                        'error' => 'কর্মচারীর কাজের তথ্য আপডেট করা যায় নি'
                    ],
                    'departureInfo' => [
                        'success' => 'কর্মচারী সফলভাবে চলে গেছেন',
                        'error' => 'কর্মচারী চলে যেতে পারেন নি'
                    ],
                    'rejoinInfo' => [
                        'success' => 'কর্মচারী সফলভাবে পুনরায় যোগদান করেছেন',
                        'error' => 'কর্মচারী যোগদান করতে পারেন নি'
                    ]
                ],
                'changeStatus' => [
                    'activate' => 'কর্মচারীকে সক্রিয় করা হয়েছে',
                    'deactivate' => 'কর্মচারীকে নিষ্ক্রিয় করা হয়েছে',
                    'error' => 'কর্মচারীর স্ট্যাটাস পরিবর্তন করা যায় নি'
                ]
            ]
        ],

        'jobPosition' => [
            'store' => [
                'success' => 'নতুন চাকুরীর পদ সফলভাবে তৈরি করা হয়েছে',
                'error' => 'নতুন চাকুরীর পদ তৈরি করা যায় নি'
            ],
            'update' => [
                'success' => 'চাকুরীর পদ সফলভাবে আপডেট করা হয়েছে',
                'error' => 'চাকুরীর পদ আপডেট করা যায় নি'
            ],
            'destroy' => [
                'success' => 'চাকুরীর পদটিকে সফলভাবে মুছে ফেলা হয়েছে',
                'error' => 'চাকুরীর পদটিকে মুছে ফেলা যায় নি'
            ],
            'changeStatus' => [
                'activate' => 'চাকুরীর পদটিকে সক্রিয় করা হয়েছে',
                'deactivate' => 'চাকুরীর পদটিকে নিষ্ক্রিয় করা হয়েছে',
                'error' => 'চাকুরীর পদের স্ট্যাটাস পরিবর্তন করা যায় নি'
            ]
        ],

        'department' => [
            'store' => [
                'success' => 'নতুন ডিপার্টমেন্ট সফলভাবে তৈরি করা হয়েছে',
                'error' => 'নতুন ডিপার্টমেন্ট তৈরি করা যায়নি'
            ],
            'update' => [
                'success' => 'ডিপার্টমেন্টটি সফলভাবে আপডেট করা হয়েছে',
                'error' => 'ডিপার্টমেন্টটি আপডেট করা যায় নি'
            ],
            'destroy' => [
                'success' => 'ডিপার্টমেন্টটি সফলভাবে মুছে ফেলা হয়েছে',
                'error' => 'ডিপার্টমেন্টটি মুছে ফেলা যায় নি'
            ],
            'changeStatus' => [
                'activate' => 'ডিপার্টমেন্টটি সক্রিয় করা হয়েছে',
                'deactivate' => 'ডিপার্টমেন্টটি নিষ্ক্রিয় করা হয়েছে'
            ]
        ],

        'leave' => [
            'leaveType' => [
                'store' => [
                    'success' => 'নতুন ছুটির ধরণ সফলভাবে তৈরি করা হয়েছে',
                    'error' => 'নতুন ছুটির ধরণ তৈরি করা যায় নি'
                ],
                'update' => [
                    'success' => 'ছুটির ধরণ সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'ছুটির ধরণ আপডেট করা যায় নি'
                ],
                'destroy' => [
                    'success' => 'ছুটির ধরণটিকে সফলভাবে মুছে ফেলা হয়েছে',
                    'error' => 'ছুটির ধরণটিকে মুছে ফেলা যায় নি'
                ],
                'changeStatus' => [
                    'activate' => 'ছুটির ধরণটিকে সক্রিয় করা হয়েছে',
                    'deactivate' => 'ছুটির ধরণটিকে নিষ্ক্রিয় করা হয়েছে',
                    'error' => 'ছুটির ধরণের স্ট্যাটাস পরিবর্তন করা যায় নি'
                ]
            ]
        ],

        'subscription' => [
            'update' => [
                'success' => 'সাবস্ক্রিপশনটি সফলভাবে আপডেট করা হয়েছে',
                'error' => 'আপনার বর্তমান সাবস্ক্রিপশন প্ল্যান আর ব্যবহারযোগ্য নয়'
            ],
            'renew' => [
                'success' => 'সাবস্ক্রিপশনটি সফলভাবে রিনিউ করা হয়েছে',
                'error' => 'সাবস্ক্রিপশনটি রিনিউ করা যায় নি',
            ]
        ]
    ]
];
